logs/throughput_writes(2017-11-18_09h34)/ratio_1:0/sharded_false/workers_32/clients_32/client_2_2_2.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  90 secs]  0 threads:      219535 ops,    2437 (avg:    2439) ops/sec, 2.47MB/sec (avg: 2.48MB/sec), 13.11 (avg: 13.11) msec latency

1         Threads
32        Connections per thread
90        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets        2466.48          ---          ---     13.11400      2563.76
Gets           0.00         0.00         0.00      0.00000         0.00
Waits          0.00          ---          ---      0.00000          ---
Totals      2466.48         0.00         0.00     13.11400      2563.76


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       2.200         0.00
SET       2.300         0.00
SET       2.400         0.00
SET       2.500         0.00
SET       2.600         0.01
SET       2.700         0.01
SET       2.800         0.02
SET       2.900         0.03
SET       3.000         0.03
SET       3.100         0.03
SET       3.200         0.03
SET       3.300         0.04
SET       3.400         0.04
SET       3.500         0.04
SET       3.600         0.04
SET       3.700         0.05
SET       3.800         0.06
SET       3.900         0.06
SET       4.000         0.07
SET       4.100         0.07
SET       4.200         0.08
SET       4.300         0.08
SET       4.400         0.09
SET       4.500         0.10
SET       4.600         0.11
SET       4.700         0.12
SET       4.800         0.13
SET       4.900         0.14
SET       5.000         0.15
SET       5.100         0.17
SET       5.200         0.18
SET       5.300         0.20
SET       5.400         0.23
SET       5.500         0.25
SET       5.600         0.28
SET       5.700         0.33
SET       5.800         0.43
SET       5.900         0.55
SET       6.000         0.71
SET       6.100         0.96
SET       6.200         1.28
SET       6.300         1.67
SET       6.400         2.14
SET       6.500         2.61
SET       6.600         3.13
SET       6.700         3.67
SET       6.800         4.17
SET       6.900         4.63
SET       7.000         5.06
SET       7.100         5.44
SET       7.200         5.78
SET       7.300         6.09
SET       7.400         6.35
SET       7.500         6.62
SET       7.600         6.85
SET       7.700         7.05
SET       7.800         7.24
SET       7.900         7.40
SET       8.000         7.58
SET       8.100         7.72
SET       8.200         7.86
SET       8.300         8.00
SET       8.400         8.12
SET       8.500         8.25
SET       8.600         8.40
SET       8.700         8.54
SET       8.800         8.68
SET       8.900         8.87
SET       9.000         9.03
SET       9.100         9.19
SET       9.200         9.38
SET       9.300         9.59
SET       9.400         9.79
SET       9.500        10.05
SET       9.600        10.34
SET       9.700        10.64
SET       9.800        10.98
SET       9.900        11.32
SET      10.000        13.99
SET      11.000        24.98
SET      12.000        44.04
SET      13.000        64.46
SET      14.000        78.26
SET      15.000        85.36
SET      16.000        90.10
SET      17.000        93.05
SET      18.000        95.21
SET      19.000        96.81
SET      20.000        97.75
SET      21.000        98.33
SET      22.000        98.79
SET      23.000        99.03
SET      24.000        99.15
SET      25.000        99.24
SET      26.000        99.30
SET      27.000        99.35
SET      28.000        99.41
SET      29.000        99.48
SET      30.000        99.51
SET      31.000        99.54
SET      32.000        99.58
SET      33.000        99.63
SET      34.000        99.66
SET      35.000        99.68
SET      36.000        99.70
SET      37.000        99.71
SET      38.000        99.72
SET      39.000        99.73
SET      40.000        99.74
SET      41.000        99.75
SET      42.000        99.76
SET      43.000        99.77
SET      44.000        99.78
SET      45.000        99.78
SET      46.000        99.79
SET      48.000        99.79
SET      49.000        99.79
SET      50.000        99.79
SET      51.000        99.80
SET      52.000        99.82
SET      53.000        99.82
SET      54.000        99.82
SET      55.000        99.82
SET      56.000        99.83
SET      57.000        99.84
SET      58.000        99.84
SET      59.000        99.85
SET      60.000        99.86
SET      61.000        99.86
SET      62.000        99.86
SET      66.000        99.87
SET      67.000        99.87
SET      68.000        99.87
SET      79.000        99.87
SET      80.000        99.88
SET      81.000        99.88
SET      82.000        99.89
SET      83.000        99.89
SET      86.000        99.89
SET      87.000        99.89
SET      89.000        99.90
SET      90.000        99.90
SET      91.000        99.90
SET      95.000        99.90
SET      98.000        99.90
SET      99.000        99.90
SET     100.000        99.93
SET     110.000        99.95
SET     120.000        99.96
SET     130.000        99.97
SET     140.000        99.99
SET     150.000        99.99
SET     170.000        99.99
SET     180.000        99.99
SET     190.000        99.99
SET     200.000       100.00
SET     210.000       100.00
SET     220.000       100.00
---
---